{
    "saltar_menu": "Skip menu",
    "volver_inicio": "Back to top",
    "seleccion_lang": "Ir a la versión en español",
    "ver_menu": "Toggle the menu",
    "menu_about": "About me > ",
    "menu_skills": "Skills > ",
    "menu_portfolio": "My work > ",
    "menu_contact": "Let's talk > ",
    "img_retrato_mmejia": "Miguel Mejía smiling at the camera during one of his exhibitions.",

    "header_h1": "Hi! I'm Miguel Mejia.",
    "header_p1": "I work in a range that spans from visual communication and research to front-end web development.",
    "header_p2": "My purpose is to support the role of communication and technology in building more inclusive societies.",
    "header_a": "My resume > ",

    "skills_dev": "Front-end development",
    "skills_dev_p1": "I have good knowledge in HTML and CSS, which I use to create sites that are accessible and fluid for the widest range of people and devices. Although I'm advancing quickly, I'm still strengthening my foundation in JavaScript, data structures and algorithms.",
    "skills_dev_p2": "I have a solid foundation in Git and deploying static sites on AWS. I have worked with Jekyll, love 11ty and am very curious about Astro.",
    "skills_dev_p3": "I have worked with and recognize the potential of libraries like jQuery or NPM, CMS like WordPress and Drupal, and No-Code like Wix or SquareSpace, but I think their undifferentiated use brings more problems than solutions.",
    "skills_dev_p4": "My next move is likely to be towards TypeScript and React, followed by NodeJS and Lua.",
    "skills_dev_p5": "With each project I always implement cumulatively at least one new concept or technique I learned that improves the user experience explicitly on screen or implicitly in the code.",
    "skills_img": "Image",
    "skills_img_p": "Fascinated by visual communication, layout and typography, I became a graphic designer. From there, I began to move towards editorial photography and the creation of visual narratives. The meticulous execution and the need to question not only what I observe, but also the place from which I do, allow me to approach complex subjects with confidence.",
    "skills_info": "Research and writing",
    "skills_info_p": "I frequently work on subjects such as visual impairment, human and labor rights, education and culture, climate change and the armed conflict. I can contribute from the research and framing of information to the creation of narratives, the formulation of strategies and the production of communicational tools",
    "img_retrato_lucy": "Lucy FerNanda yawning during her afternoon nap.",
    "skills_other": "Other skills",
    "skills_other_p": "For pleasure and responsibility I need to understand deeply what I am going to communicate, therefore, I learned to learn constantly. However, information and learning will always be incomplete if they are not shared, so I experiment until I find creative ways to communicate them. I have developed classes and workshops on visual communication, semiotics and photography. I have also organized talks and opened conversations about ethics, technology and comunication.",

    "portfolio_intro_h2": "My work",
    "portfolio_intro_p1": "Although the image is always present in my work, the ways in which I address it can change. Currently my work focuses on the access to information and the creation of digital tools.",
    "portfolio_intro_p2": "This portfolio is a sample of the work and exercises I've done in front-end development and how they intertwine with my experience as a visual communicator.",
    "portfolio_intro_a1": "Portrait portfolio > ",
    "portfolio_intro_a2": "Comercial portfolio > ",
    "portfolio_intro_a3": "Media portfolio > ",
    "portfolio_filter_li1": "Filter",
    "portfolio_filter_li2": "Web development/",
    "portfolio_filter_li3": "+ Info/",
    "portfolio_filter_li4": "+ image/",

    "img_portfolio_CD": "Dignified Contracts for all domestic workers!",
    "portfolio_CD_title": "ConTrato Digno",
    "portfolio_CD_span": "Web development + Info",
    "portfolio_CD_p": "As support for the second stage of ConTrato Digno for the formalization of domestic workers' hiring in Mexico and Guatemala, I created the narrative, structured and wrote the contents and programmed the website that organizes all the information of the campaign.",
    "portfolio_CD_li1": "Performed in AMZK",
    "portfolio_CD_li2": "Client: PADF México",
    "portfolio_CD_li3": "Year: 2023",
    "portfolio_CD_more": "Read more > ",
    "portfolio_CD_a": "Go to the website > ",
    "portfolio_CD_modal_cerrar": "Close X",
    "portfolio_CD_modal_title": "ConTrato Digno",
    "portfolio_CD_modal_span": "Web development + Info",
    "img_portfolio_CD_modal_img1": "Technical script for the website",
    "portfolio_CD_modal_img1_caption": "Based on the technical and narrative script that implemented the information provided by PADF, the AMZK Studio design team created the artwork.",
    "portfolio_CD_modal_p1": "After a series of meetings in which I received information about the campaign, the results of the first stage and the expectations for the second stage, I sent the client a series of questions to help them organize the data.",
    "img_portfolio_CD_modal_img2": "Home screen of the ConTrato Digno website.",
    "portfolio_CD_modal_img2_caption": "Implementation of the narrative detailed in the technical script. Design and illustration by Anna Echavarría and Laura Burgos for AMZK Studio.",
    "portfolio_CD_modal_p2": "From there, I structured the narrative for the microsite, developed the texts and elaborated the wireframes on which the design team would work. With content and the artwork approved, I started the programming process.",
    "img_portfolio_CD_modal_img3": "Wireframe explaining the structure, the navigation and the contents that will be present.",
    "portfolio_CD_modal_img3_caption": "Before the elaboration of the design, a wireframe with the final information was elaborated, which allowed us to be aware of what information was going to be visible at each moment.",
    "portfolio_CD_modal_p3": "Although it was not within the requirements of the site, I was starting my studies on accessibility, I took the opportunity to improve the accessibility of the site from the implementation of Semantic HTML.",
    "portfolio_CD_modal_a": "Go to the ConTrato Digno website > ",

    "img_portfolio_MM": "Portrait I made of Carolina Ardila",
    "portfolio_MM_span": "Web development + Image",
    "portfolio_MM_p1": "In order to differentiate my portfolio from other photography portfolios, hierarchize the images, allow quick updates and have a fluid base structure that allowed me to replicate it in my other portfolios, I designed and programmed my website.",
    "portfolio_MM_p2": "Year: 2021",
    "portfolio_MM_more": "Read more > ",
    "portfolio_MM_a": "Go to my portfolio > ",
    "portfolio_MM_modal_cerrar": "Close X",
    "portfolio_MM_modal_span": "Web development + Image",
    "img_portfolio_MM_modal_img1": "mmejia.com landing page",
    "portfolio_MM_modal_img1_caption": "the site's grid allows free arrangement and size variation of the images without losing their structure.",
    "portfolio_MM_modal_p1": "The redesign and programming of my photography portfolio was necessary after more than 10 years of uninterrupted work.",
    "portfolio_MM_modal_p2": "I came from having a custom WordPress portfolio as far as the template and my knowledge allowed me. The site looked like any other WordPress photography site, so I decided to take it apart and redo it from scratch with the following parameters for its development: Use only code that I wrote myself or that I could manipulate and explain line by line what I was doing. Develop a fluid layout that responded to the images and my narrative intentions. Adapt to as many devices and use as few media queries as possible.",
    "img_portfolio_MM_modal_img2": "landing page with my work on commercial photography",
    "portfolio_MM_modal_img2_caption": "The same structure allowed it to be easily tailored to present both my commercial work...",
    "portfolio_MM_modal_p3": "Knowing Grid helped me to make that transition from editorial to web design more natural, avoided having to make 80 versions of the site, and implement a structural base to present the different types of work I do without mixing them while preserving a visual unity for my brand.",
    "img_portfolio_MM_modal_img3": "landing page containing my work in audiovisual projects",
    "portfolio_MM_modal_img3_caption": "... such as audiovisual, and the incorporation of a blog (which was abandoned, like 99% of blogs).",
    "portfolio_MM_modal_p4": "It was a nice reencounter with web design and learning. Since then, web design and development became part of my life again.",
    "portfolio_MM_modal_a": "Go to my portfolio > ",

    "img_portfolio_TDH": "Domestic Workers of the Americas united for the recognition of their rights",
    "portfolio_TDH_title": "Domestic Workers",
    "portfolio_TDH_span": "Web development + Info",
    "portfolio_TDH_p1": "Based on the report 'Rights of remunerated domestic workers in the Americas', I structured the information, created the narratives and wrote the contents of all the pieces of the campaign for its distribution; from grids for social networks and scripts for audiovisuals to the programming of the microsite where all the information was centralized.",
    "portfolio_TDH_li1": "Performed in AMZK",
    "portfolio_TDH_li2": "Client: CIM|OAS",
    "portfolio_TDH_li3": "Year: 2022",
    "portfolio_TDH_more": "Read more > ",
    "portfolio_TDH_a": "Go to the website > ",
    "portfolio_TDH_modal_cerrar": "Close X",
    "portfolio_TDH_modal_title": "Domestic Workers",
    "portfolio_TDH_modal_span": "Web development + Info",
    "img_portfolio_TDH_modal_img1": "Mosaic composed of several screenshots of the site in Spanish and English",
    "portfolio_TDH_modal_img1_caption": "Home page of the domestic workers site. Design and illustration by Alejandra Velez and Anna Echavarría for AMZK Studio.",
    "portfolio_TDH_modal_p1": "In terms of information and content, I developed the narratives so that they would be close to both the workers and the employers, while at the same time a careful and detailed representation sought to vindicate the work of paid domestic workers.",
    "img_portfolio_TDH_modal_img2": "Wireframe of the website",
    "portfolio_TDH_modal_img2_caption": "Having an outline of how they wanted to present the information, the design team took this structure to start illustrating the site's artwork.",
    "portfolio_TDH_modal_p2": "In terms of coding, taking into account the different possibilities of access to information and technology and the diversity of contexts in which this work is carried out, the microsite was designed to be bilingual and to consume the least amount of data and processing resources by the end users. The fallback considered devices that had not been updated in the last 5 years.",
    "img_portfolio_TDH_modal_img3": "Violence meter on the escalation of violence against domestic workers",
    "portfolio_TDH_modal_img3_caption": "The layout took into account the scroll of the person visiting the site to give a sense of dynamism without loading the site with scripts.",
    "portfolio_TDH_modal_a": "Go to the Domestic Workers' microsite > ",
    
    "img_portfolio_AMZK": "Iconografía de Amazink studio",
    "portfolio_AMZK_span": "Web development + Info + Image",
    "portfolio_AMZK_p1": "I carried out the research, development and writing of the content grid for the studio's social networks between 2020 and 2023. Along with this and as part of the rebranding process carried out by the studio in early 2023, I structured and programmed the new site.",
    "portfolio_AMZK_li1": "Performed in AMZK",
    "portfolio_AMZK_li2": "Years: 2020 -2023",
    "portfolio_AMZK_more": "Read more > ",
    "portfolio_AMZK_a": "Go to the website > ",
    "portfolio_AMZK_modal_cerrar": "Close X",
    "portfolio_AMZK_modal_span": "Web development + Info + Image",
    "img_portfolio_AMZK_modal_img1": "AMZK's publication grid on Instagram.",
    "portfolio_AMZK_modal_img1_caption": "During 3 years I made more than 200 publications in social networks, where topics of interest for the study were addressed.",
    "portfolio_AMZK_modal_p1-strong": "Social networks:",
    "portfolio_AMZK_modal_p1": "Throughout 3 years I participated in the planning of the content grid, I did the research and writing of content that would later be integrated into the artwork made by the design team, which I then published on AMZK's social networks. The illustration work was done by Juan José Bianchi, Anna Echavarría, Laura Burgos and Alejandra Velez, among others.",
    "img_portfolio_AMZK_modal_img2": "AMZK site home screen",
    "portfolio_AMZK_modal_p2-strong": "Website:",
    "portfolio_AMZK_modal_p2": "The project started with the migration of a site developed and managed in WordPress to a 'static' site that should allow for quick content updates. The illustrations of the site were made by Juan José Bianchi and the animations by Laura Burgos.",
    "img_portfolio_AMZK_modal_img3": "Portfolio with the projects carried out by AMZK",
    "portfolio_AMZK_modal_p3": "To design the new site I only had the brand manual and the advice of the design director, at this point we took the opportunity to correct the UX and accessibility errors found in the previous site.",
    "img_portfolio_AMZK_modal_img4": "Detalle sobre uno de los proyectos publicados en el sitio",
    "portfolio_AMZK_modal_p4": "Once the site was designed and structured, I continued with the writing of the initial contents within several Markdowns, to then incorporate the translation and uploading of all the studio's projects.",
    "portfolio_AMZK_modal_a": "Go to the AMZK website > ",

    "img_portfolio_MAMA": "Lumbung in Nuquí and the Colombian Society of Mastozoology",
    "portfolio_MAMA_span": "Web development",
    "portfolio_MAMA_p1": "Although their development was carried out in different contexts and situations, both projects share principles of adaptation to live information. In the first one I had the opportunity to structure the loading and live updating, in the second one, it was the adaptation of an already finished site to new requirements and contents.",
    "portfolio_MAMA_p2": "Years: 2021 - 2023",
    "portfolio_MAMA_more": "Read more > ",
    "portfolio_MAMA_modal_cerrar": "Close X",
    "portfolio_MAMA_modal_h2_mama": "Lumbung Nuquí - Más Arte Más Acción",
    "portfolio_MAMA_modal_span_mama": "Web development + Image",
    "img_portfolio_MAMA_modal_img1": "Presentation of documenta 15 and Lumbung in Nuquí",
    "portfolio_MAMA_modal_img1_caption": "In the implementation, the client made some navigation and structure changes that differed a little from the proposal they had approved. Among those, they eliminated the event header and removed some of the elements that contained the event glossary.",
    "portfolio_MAMA_modal_p1": "I developed a simple and flexible structure that allowed me to upload the written and visual histories of the event, photographs, videos and audios as they came out during a visualization workshop held in Nuquí-Chocó. The work was Performed in AMZK in 2021. The visual recording of the event were done by Juliana Serrano and the photographs by Paula OG.",
    "portfolio_MAMA_modal_a1": "Go to Lumbung - Nuquí > ",
    "portfolio_MAMA_modal_h2_scmas": "Colombian Society of Mastozoology",
    "portfolio_MAMA_modal_span_scmas": "Web development",
    "img_portfolio_MAMA_modal_img2": "Home banner in the Colombian Society of Mastozoology website",
    "portfolio_MAMA_modal_p2": "My role in this project was to close the website renovation process that had been initiated by another person in WordPress. This process consisted of integrating new requirements and update the information to the initial structure and adding the social networks of SCMas.",
    "portfolio_MAMA_modal_a2": "Go to the SCMas website > ",

    "img_portfolio_PRG": "Base structure of an IIFE function in JavaScript",
    "portfolio_PRG_title": "Coding Exercises",
    "portfolio_PRG_span": "Web development",
    "portfolio_PRG_p1": "I find it curious how people try to hide errors and the need to avoid them when they are indispensable for learning, building knowledge and experience. These are some of the exercises I have done as I deepen my knowledge in coding.",
    "portfolio_PRG_p2": "Years: 2023 - 2024",
    "portfolio_PRG_more": "Read more > ",
    "portfolio_PRG_modal_cerrar": "Close X",
    "portfolio_PRG_modal_h2_EJ1": "Etch-a-sketch",
    "portfolio_PRG_modal_p1": "I created a pixel drawing board, whose dimensions adapt to the user's screen and allows the user to change the density of the grid. I wanted to create a simple and minimalist interface, where the only important thing is draw. I took the opportunity to make a proof of concept to facilitate drawing with trackpad by separating click and move actions. With this I was able to learn different operations with the DOM and how to make a color mix from mathematical equations.",
    "portfolio_PRG_modal_a1": "Go to my Etch-a-sketch > ",
    "portfolio_PRG_modal_h2_EJ2": "Calculator",
    "portfolio_PRG_modal_p2": "People who are learning industrial design make chairs, those who are studying graphic design make business cards, those who want to become photographers make a portrait holding their camera in front of a mirror in the bathroom, and those of us who are learning coding at some point make a calculator. It was an exercise to register interaction sequences, I based it on the operation of the classic Casio calculators. I incorporated memory boxes and the possibility of performing compound actions to perform operations with percentages.",
    "portfolio_PRG_modal_a2": "Go to my Calculator > ",

    "contact_h2": "¡Let's talk!",
    "contact_h3_1": "My social networks",
    "contact_h3_2": "My contact info",
    "contact_h3_3": "Get in touch",
    "contact_form_label1": "Your name",
    "contact_form_label1_validation": "* Write your name",
    "contact_form_label2": "Your email",
    "contact_form_label2_validation1": "* Enter your email address",
    "contact_form_label2_validation2": "* Please enter a valid email address",
    "contact_form_label3": "Your message",
    "contact_form_label3_validation": "* Write your message",
    "contact_form_submit": "Send > "
}
