{
    "saltar_menu": "Saltar el menu",
    "volver_inicio": "Volver al inicio",
    "seleccion_lang": "Ir a la versión en inglés",
    "ver_menu": "mostrar u ocultar el menú",
    "menu_about": "Sobre mí > ",
    "menu_skills": "Aptitudes > ",
    "menu_portfolio": "Mi trabajo > ",
    "menu_contact": "Contáctame > ",
    "img_retrato_mmejia": "Miguel Mejía sonriendo a la cámara durante una exposición",

    "header_h1": "¡Hola! Soy Miguel Mejía.",
    "header_p1": "Trabajo en un rango que abarca desde la comunicación visual y la investigación hasta el desarrollo web front-end.",
    "header_p2": "Mi propósito es apoyar el papel de la comunicación y la tecnología en la construcción de sociedades más inclusivas.",
    "header_a": "Mi hoja de vida > ",

    "skills_dev": "Desarrollo front-end",
    "skills_dev_p1": "Tengo conocimientos sólidos en HTML y CSS, los cuales utilizo para la creación de sitios accesibles y fluidos para la mayor cantidad de personas y dispositivos. Aunque avanzo con rapidez, sigo fortaleciendo mis bases en JavaScript, estructuras de datos y algoritmos.",
    "skills_dev_p2": "Cuento con buenas bases en Git y el despliegue de sitios estáticos en AWS. He trabajado con Jekyll, amo 11ty y tengo mucha curiosidad por Astro.",
    "skills_dev_p3": "He trabajado y reconozco el potencial de bibliotecas como jQuery o NPM, CMS como WordPress y Drupal, y No-Code como Wix o SquareSpace, pero creo que su uso indiscriminado trae más problemas que soluciones.",
    "skills_dev_p4": "Es probable que mi próximo paso se dirija hacia TypeScript y React, seguido por NodeJS y Lua.",
    "skills_dev_p5": "Con cada proyecto siempre implemento de forma acumulativa al menos un nuevo concepto o técnica que aprendo y que mejore la experiencia de los usuarios de forma explícita en pantalla o implícita en el código.",
    "skills_img": "Imagen",
    "skills_img_p": "Fascinado por la semiótica, la diagramación y la tipografía, me formé como diseñador gráfico. Desde ahí, comencé a moverme hacia la fotografía editorial y la creación de narrativas visuales. La ejecución minuciosa y la necesidad de cuestionar tanto lo que observo como el lugar desde el cual lo hago me permiten abordar con confianza temáticas complejas.",
    "skills_info": "Información y escritura",
    "skills_info_p": "Con frecuencia trabajo temas como discapacidad visual, derechos humanos y laborales, educación y cultura, cambio climático y conflicto armado. Puedo aportar desde la investigación y estructuración de la información hasta la creación de narrativas, el desarrollo de estrategias y productos para su difusión.",
    "img_retrato_lucy": "Lucy FerNanda bostezando durante su siesta de la tarde",
    "skills_other": "Otras aptitudes",
    "skills_other_p": "Por gusto y responsabilidad necesito comprender a fondo lo que voy a comunicar, por lo tanto, aprendí a aprender constantemente. Sin embargo, la información y el aprendizaje siempre estarán incompletos si no se comparten, así que experimento hasta encontrar formas creativas para transmitirlos. He desarrollado clases y talleres sobre comunicación visual, semiótica y fotografía. También he organizado laboratorios y abierto conversatorios para la implementación ética de nuevas tecnologías en equipos de trabajo.",

    "portfolio_intro_h2": "Mi trabajo",
    "portfolio_intro_p1": "Aunque la imagen siempre está presente en mi trabajo, las formas en las que la abordo pueden cambiar. Actualmente mi enfoque se orienta hacia el acceso a la información y la creación de herramientas digitales.",
    "portfolio_intro_p2": "Este portafolio es una muestra de los trabajos y ejercicios que he llevado a cabo en el desarrollo front-end y de cómo se entrelazan con mi experiencia como comunicador visual.",
    "portfolio_intro_a1": "Portafolio de retratos > ",
    "portfolio_intro_a2": "Portafolio de foto-producto > ",
    "portfolio_intro_a3": "Portafolio Audiovisual > ",
    "portfolio_filter_li1": "Filtrar",
    "portfolio_filter_li2": "Programación/",
    "portfolio_filter_li3": "+ Información/",
    "portfolio_filter_li4": "+ imagen/",

    "img_portfolio_CD": "Contrato Digno para todas las trabajadoras del hogar",
    "portfolio_CD_title": "ConTrato Digno",
    "portfolio_CD_span": "Programación + Información",
    "portfolio_CD_p": "Como apoyo a la segunda etapa de ConTrato Digno para la formalización de la contratación de las trabajadoras del Hogar en México y Guatemala, creé la narrativa, estructuré, redacté contenidos y programé el sitio web que centraliza toda la información de la campaña.",
    "portfolio_CD_li1": "Realizado en AMZK",
    "portfolio_CD_li2": "Cliente: PADF México",
    "portfolio_CD_li3": "Año: 2023",
    "portfolio_CD_more": "Leer más > ",
    "portfolio_CD_a": "Ir al micrositio > ",
    "portfolio_CD_modal_cerrar": "Cerrar X",
    "portfolio_CD_modal_title": "ConTrato Digno",
    "portfolio_CD_modal_span": "Programación + Información",
    "img_portfolio_CD_modal_img1": "Guión técnico del sitio",
    "portfolio_CD_modal_img1_caption": "A partir del guión técnico y narrativo que implementaba la información suministrada por PADF el equipo de diseño de AMZK Studio realizó los artes.",
    "portfolio_CD_modal_p1": "Luego de una serie de reuniones en las que recibí información sobre la campaña, los resultados de la primera etapa y las expectativas para la segunda, envié al cliente una serie de preguntas orientadoras que ayudaron a organizar los datos.",
    "img_portfolio_CD_modal_img2": "Pantalla de inicio del sitio ConTrato Digno, para PADF.",
    "portfolio_CD_modal_img2_caption": "Implementación de la narrativa especificada en el guión técnico. Diseño e ilustración por Anna Echavarría y Laura Burgos para AMZK Studio.",
    "portfolio_CD_modal_p2": "A partir eso, estructuré la narrativa para el micrositio, desarrollé los textos y elaboré los wireframes sobre los cuales trabajaría el equipo de diseño. Con los artes y contenidos aprobados, inicié el proceso de programación.",
    "img_portfolio_CD_modal_img3": "Wireframe que explica la funcionalidad de la pestaña y los contenidos que estarán presentes al cliente y el equipo de diseño.",
    "portfolio_CD_modal_img3_caption": "Antes de la elaboración del diseño se elaboró un wireframe con la información consolidada, el cual permitía tener consciendia de qué información iba a ser visible en qué momento.",
    "portfolio_CD_modal_p3": "Aunque no estaba dentro de los requerimientos del sitio, me encontraba iniciando mis estudios sobre accesibilidad, aproveché para mejorar la accesibilidad del sitio desde la implementación de Semantic HTML.",
    "portfolio_CD_modal_a": "Ir al micrositio de ConTrato Digno > ",

    "img_portfolio_MM": "Retrato de Carolina Ardila realizado por Miguel Mejía",
    "portfolio_MM_span": "Programación + Imagen",
    "portfolio_MM_p1": "Con el objetivo de diferenciar este de otros portafolios de fotografía, jerarquizar las imágenes, permitir su actualización rápida y tener una estructura base fluida que me permitiera replicarla en mis otros portafolios de trabajo, diseñe y programé mi sitio.",
    "portfolio_MM_p2": "Año: 2021",
    "portfolio_MM_more": "Leer más > ",
    "portfolio_MM_a": "Ir al portafolio > ",
    "portfolio_MM_modal_cerrar": "Cerrar X",
    "portfolio_MM_modal_span": "Programación + Imagen",
    "img_portfolio_MM_modal_img1": "Página de inicio de mmejia.com",
    "portfolio_MM_modal_img1_caption": "La retícula del sitio permite la libre disposición y variación en el tamaño de las imágenes sin perder su estructura.",
    "portfolio_MM_modal_p1": "El rediseño y programación de mi portafolio de fotografía era necesario luego de más de 10 años de trabajo constante.",
    "portfolio_MM_modal_p2": "Venía de tener un portafolio en WordPress personalizado hasta donde la plantilla y mi conocimiento me permitían. El sitio se veía como cualquier otro sitio de fotografía en WordPress, por lo que decidí desmontarlo y rehacerlo desde cero con los siguientes parámetros para su desarrollo: Emplear únicamente código redactado por mí o que pudiera manipular y explicar línea a línea lo que hacía. Desarrollar una diagramación fluida que respondiera a las imágenes y mis intenciones narrativas. Adaptarse a la mayor cantidad de dispositivos y emplear la menor cantidad de Media Querys posible.",
    "img_portfolio_MM_modal_img2": "Página del que contiene el trabajo comercial de mmejia.com",
    "portfolio_MM_modal_img2_caption": "La misma estructura permitió su adaptación para presentar tanto mi trabajo comercial...",
    "portfolio_MM_modal_p3": "Conocer Grid ayudó a que esa transición de diseño editorial a web fuera más natural, evitó tener que hacer 80 versiones del sitio, e implementar una base estructural para presentar los diferentes tipos de trabajo que realizo sin mezclarlos mientras conservan una unidad visual frente a mi marca.",
    "img_portfolio_MM_modal_img3": "Página del que contiene el trabajo audiovisual de mmejia.com",
    "portfolio_MM_modal_img3_caption": "... como el audiovisual, y la incorporación de un blog (que quedó abandonado, como el 99% de los blogs).",
    "portfolio_MM_modal_p4": "Fue un lindo reencuentro con el diseño web y el aprendizaje, desde ese entonces el diseño y desarrollo web volvieron a ser parte de mi vida.",
    "portfolio_MM_modal_a": "Ir al portafolio > ",

    "img_portfolio_TDH": "Trabajadoras del Hogar de todas las Américas unidas por el reconocimiento de sus derechos",
    "portfolio_TDH_title": "Trabajadoras del Hogar",
    "portfolio_TDH_span": "Programación + Información",
    "portfolio_TDH_p1": "A partir del informe “Derechos de las trabajadoras remuneradas del hogar de las Américas”, estructuré la información, creé las narrativas y redacté contenidos de todas las piezas de la campaña para su divulgación desde parrillas para redes sociales y guiones para audiovisuales hasta la programación del micrositio donde se centralizó toda la información.",
    "portfolio_TDH_li1": "Realizado en AMZK",
    "portfolio_TDH_li2": "Cliente: CIM|OEA",
    "portfolio_TDH_li3": "Año: 2021",
    "portfolio_TDH_more": "Leer más > ",
    "portfolio_TDH_a": "Ir al micrositio > ",
    "portfolio_TDH_modal_cerrar": "Cerrar X",
    "portfolio_TDH_modal_title": "Trabajadoras del Hogar",
    "portfolio_TDH_modal_span": "Programación + Información",
    "img_portfolio_TDH_modal_img1": "Mosaico compuesto por varios pantallazos del sitio en español e inglés",
    "portfolio_TDH_modal_img1_caption": "Página de inicio del sitio de trabajadoras del hogar. Diseño e ilustración por Alejandra Velez y Anna Echavarría para AMZK Studio.",
    "portfolio_TDH_modal_p1": "Por la parte de información y contenidos, desarrollé las narrativas para que fueran cercanas tanto a las trabajadoras como a las personas empleadoras, al mismo tiempo que desde una representación cuidadosa y detallada reivindica la labor de las trabajadoras domésticas remuneradas.",
    "img_portfolio_TDH_modal_img2": "Wireframe con la información sobre la escolaridad de las trabajadoras del hogar",
    "portfolio_TDH_modal_img2_caption": "Al tener un esbozo de cómo se deseaba presentar la información el equipo de diseño tomó esta estructura para empezar a ilustrar los artes del sitio.",
    "portfolio_TDH_modal_p2": "Desde la programación, teniendo en cuenta las diferentes posibilidades de acceso a la información y tecnología que sumadas a la diversidad de contextos en los que se realiza este trabajo, el micrositio se realizó bilingüe y para consumir la menor cantidad de datos y recursos de procesamiento por parte de las usuarias finales. El fallback contempló dispositivos que no se hubieran actualizado en los últimos 5 años.",
    "img_portfolio_TDH_modal_img3": "Violentómetro sobre el escalamiento de violencia contra las trabajadoras del hogar",
    "portfolio_TDH_modal_img3_caption": "La diagramación que tuvo en cuenta el scroll de la persona que visitaba el sitio para dar una sensación de dinamismo sin cargar el sitio con scripts.",
    "portfolio_TDH_modal_a": "Enlace al micrositio de Trabajadoras del Hogar > ",
    
    "img_portfolio_AMZK": "Iconografía de Amazink studio",
    "portfolio_AMZK_span": "Programación + Información + Imagen",
    "portfolio_AMZK_p1": "A partir del informe “Derechos de las trabajadoras remuneradas del hogar de las Américas”, estructuré la información, creé las narrativas y redacté contenidos de todas las piezas de la campaña para su divulgación desde parrillas para redes sociales y guiones para audiovisuales hasta la programación del micrositio donde se centralizó toda la información.",
    "portfolio_AMZK_li1": "Realizado en AMZK",
    "portfolio_AMZK_li2": "Año: 2021",
    "portfolio_AMZK_more": "Leer más > ",
    "portfolio_AMZK_a": "Ir al sitio > ",
    "portfolio_AMZK_modal_cerrar": "Cerrar X",
    "portfolio_AMZK_modal_span": "Programación + Información + Imagen",
    "img_portfolio_AMZK_modal_img1": "Parrilla de publicaciones de Amazink en Instagram",
    "portfolio_AMZK_modal_img1_caption": "Durante 3 años se realizaron más de 200 publicaciones en redes, donde se abordaban temas de interés para el estudio.",
    "portfolio_AMZK_modal_p1-strong": "Redes:",
    "portfolio_AMZK_modal_p1": "A lo largo de 3 años participé en la planificación de la parrilla de contenidos, realicé la investigación y redacción de contenidos que luego se integrarían a las artes realizadas por el equipo de diseño, que luego publiqué de las redes sociales de AMZK. El trabajo de ilustración fue realizado por Juan José Bianchi, Anna Echavarría, Laura Burgos y Alejandra Velez.",
    "img_portfolio_AMZK_modal_img2": "Pantalla de inicio del sitio de Amazink",
    "portfolio_AMZK_modal_p2-strong": "Sitio web:",
    "portfolio_AMZK_modal_p2": "proyecto inició la migración de un sitio desarrollado y administrado en WordPress a un sitio “estático” que permitía la actualización rápida de contenidos. Las ilustraciones del sitio fueron realizadas por Juan José Bianchi y las animaciones por Laura Burgos.",
    "img_portfolio_AMZK_modal_img3": "Portafolio con los proyectos realizados por amazink",
    "portfolio_AMZK_modal_p3": "proyecto inició la migración de un sitio desarrollado y administrado en WordPress a un sitio “estático” que permitía la actualización rápida de contenidos. Las ilustraciones del sitio fueron realizadas por Juan José Bianchi y las animaciones por Laura Burgos.",
    "img_portfolio_AMZK_modal_img4": "Portafolio con los proyectos realizados por amazink",
    "portfolio_AMZK_modal_p4": "Una vez diseñado y estructurado el sitio, seguí con la redacción de los contenidos iniciales dentro de varios Markdown. Una vez terminada la carga inicial del sitio, incorporé la traducción y la carga de todos los proyectos del estudio.",
    "portfolio_AMZK_modal_a": "Ir al sitio de AMZK studio > ",

    "img_portfolio_MAMA": "Lumbung en Nuquí y los Mamíferos en Colombia",
    "portfolio_MAMA_span": "Programación",
    "portfolio_MAMA_p1": "Aunque su desarrollo fue realizado en contextos y situaciones diferentes, ambos proyectos comparten principios de adaptación a información viva. En el primero tuve la oportunidad de estructurar la carga y actualización en caliente, en el segundo, fue la adaptación de un sitio ya finalizado a unos nuevos requerimientos y contenidos.",
    "portfolio_MAMA_p2": "Años: 2021 - 2023",
    "portfolio_MAMA_more": "Leer más > ",
    "portfolio_MAMA_modal_cerrar": "Cerrar X",
    "portfolio_MAMA_modal_h2_mama": "Lumbung Nuquí - Más Arte Más Acción",
    "portfolio_MAMA_modal_span_mama": "Programación + Imagen",
    "img_portfolio_MAMA_modal_img1": "Presentación de la documenta 15 y Lumbung Nuquí",
    "portfolio_MAMA_modal_img1_caption": "En la implementación, el cliente realizó unos cambios de navegación y estructura que difieren un poco de la propuesta que habñian aprobado. dentro de esos, eliminaron el cabezote del evento y eliminaron algunos de los elementos que contenía el glosario del evento.",
    "portfolio_MAMA_modal_p1": "Desarrollé una estructura sencilla y flexible que me permitiera la carga de las relatorías escritas y visuales del evento, las fotografías, los videos y los audios a medida que salían durante un taller de visualización realizado en Nuquí-Chocó. El trabajo fue realizado en AMZK en el 2021. Las relatorías visuales del evento fueron realizadas por Juliana Serrano y las fotografías por Paula OG.",
    "portfolio_MAMA_modal_a1": "Ir a Lumbung - Nuquí > ",
    "portfolio_MAMA_modal_h2_scmas": "Sociedad Colombiana de Mastozoologia",
    "portfolio_MAMA_modal_span_scmas": "Programación",
    "img_portfolio_MAMA_modal_img2": "Banner inicial del sitio de la sociedad colombiana de Mastozoología",
    "portfolio_MAMA_modal_p2": "Mi rol en este proyecto fue cerrar el proceso de renovación del sitio web que había sido iniciado en WordPress. Este proceso consistió en incorporar los nuevos requerimientos y la información actualizada a la estructura inicial e integrar las redes sociales de la SCMas.",
    "portfolio_MAMA_modal_a2": "Ir al sitio de la SCMas > ",

    "img_portfolio_PRG": "Estructura base de una función IIFE",
    "portfolio_PRG_title": "Ejercicios de programación",
    "portfolio_PRG_span": "Programación",
    "portfolio_PRG_p1": "Me produce curiosidad cómo se trata de ocultar los errores y la necesidad evitarlos cuando estos son indispensables para el aprendizaje, la construcción de conocimiento y experiencia. Estos son algunos de los ejercicios que he realizado a medida que profundizo mis conocimientos en programación.",
    "portfolio_PRG_p2": "Años: 2023 - 2024",
    "portfolio_PRG_more": "Leer más > ",
    "portfolio_PRG_modal_cerrar": "Cerrar X",
    "portfolio_PRG_modal_h2_EJ1": "Etch-a-sketch",
    "portfolio_PRG_modal_p1": "Realicé un tablero de dibujo por pixeles, cuyas dimensiones se acomodan a la pantalla del usuario y le permite cambiar la densidad de la retícula. Quise elaborar una interfase sencilla y minimalista, donde lo único que importa es dibujar. Aproveché para realizar una prueba de concepto para facilitar el dibujo con trackpad al separar acciones de clic y movimiento. Con este pude aprender diferentes operaciones con el DOM y cómo realizar una mezcla de colores desde ecuaciones matemáticas.",
    "portfolio_PRG_modal_a1": "Ir al tablero de dibujo > ",
    "portfolio_PRG_modal_h2_EJ2": "Calculadora",
    "portfolio_PRG_modal_p2": "Las personas que aprenden diseño industrial hacen sillas, las que aprenden gráfico, tarjetas de presentación, las que quieren dedicarse a la fotografía, un retrato sosteniendo su cámara ente el espejo de un baño y las personas que aprendemos programación en algún momento hacemos una calculadora. Fue un ejercicio para hacer registro de secuencias de interacción, me basé en el funcionamiento de las calculadoras Casio clásicas. Incorpore casillas de memoria de memoria y la posibilidad de realizar acciones compuestas para realizar operaciones con porcentajes.",
    "portfolio_PRG_modal_a2": "Ir a la calculadora > "
}
